{
  "title": "RHEL8 Labs",
  "private": true,
  "courses": [
    {
      "external_link": "https://lab.redhat.com/webconsole-software",
      "title": "Managing system updates using the web console",
      "description": "Explore how someone with limited Linux experience can apply system updates to Red Hat Enterprise Linux systems through this user friendly web interface."
    },
    {
      "external_link": "https://lab.redhat.com/appstream-manage",
      "title": "Managing software from an application stream",
      "description": "Learn how to choose versions of popular and supported open source languages and offer them to users through an application stream."
    },
    {
      "external_link": "https://lab.redhat.com/podman-deploy",
      "title": "Deploying containers using Podman",
      "description": "Explore how Podman helps you run workloads in containers by taking an existing container image and deploying it into a runtime environment."
    },
    {
      "external_link": "https://lab.redhat.com/buildah",
      "title": "Creating images with buildah",
      "description": "Try different methods to build an application container, modify an existing container image and build one from scratch using the Container Tool buildah."
    },
    {
      "external_link": "https://lab.redhat.com/session-recording-tlog",
      "title": "Configuring Terminal Session Recording",
      "description": "Keep track of what is happening on your systems by using Terminal Session Recording to record and review terminal sessions of users and administrators."
    },
    {
      "external_link": "https://lab.redhat.com/vdo-configure",
      "title": "Reducing Operational and Storage Costs with Virtual Data Optimizer (VDO)",
      "description": "Explore how Virtual Data Optimizer (VDO) can reduce the amount of disk space files use, allowing you to save on storage costs."
    },
    {
      "external_link": "https://lab.redhat.com/imagebuilder",
      "title": "Using Web Console to build virtual machine images",
      "description": "Learn how to manage virtual machines produced for different providers through a single, Web Console included application."
    },
    {
      "external_link": "https://lab.redhat.com/ebpf-tracing",
      "title": "Kernel Tracing with eBPF [Technology Preview]",
      "description": "Troubleshoot disk performance and latency using eBPF tools.  This is a Tech Preview feature in Red Hat Enterprise Linux."
    }
  ]
}
