{
  "title": "RHEL8 Labs",
  "private": true,
  "courses": [
    {
      "external_link": "https://lab.redhat.com/session-recording-tlog",
      "title": "Configuring Terminal Session Recording",
      "description": "Keep track of what is happening on your systems by using Terminal Session Recording to record and review terminal sessions of users and administrators."
    },
    {
      "external_link": "https://lab.redhat.com/appstream-manage",
      "title": "Managing software from an application stream",
      "description": "Learn how to choose versions of popular and supported open source languages and offer them to users through an application stream."
    },
    {
      "external_link": "https://lab.redhat.com/helpful-commands",
      "title": "Helpful Linux Commands [Admin 101]",
      "description": "Add a few essential commands to your Linux toolbox."
    },
    {
      "external_link": "https://lab.redhat.com/podman-deploy",
      "title": "Deploying containers using Container Tools [podman]",
      "description": "Explore how Podman helps you run workloads in containers by taking an existing container image and deploying it into a runtime environment."
    },
    {
      "external_link": "https://play.instruqt.com/rhel/tracks/rhel-system-roles",
      "title": "Building a standard operating environment with RHEL System Roles",
      "description": "Use RHEL System Roles to create and apply a standard set of configuration for systems using Ansible-based RHEL System Roles."
    },
    {
      "external_link": "https://lab.redhat.com/file-permissions",
      "title": "Using file permissions [Admin 101]",
      "description": "Control access to file content using the Linux file permission system."
    },
    {
      "external_link": "https://lab.redhat.com/sql-server-cstore",
      "title": "Red Hat Enterprise Linux with SQL Server Columnstores",
      "description": "Improve SQL Server performance by using Red Hat Enterprise Linux performance tools and SQL Server Columnstores."
    },
    {
      "external_link": "https://lab.redhat.com/ebpf-tracing",
      "title": "Performance observability in practice with bcc-tools",
      "description": "Collect data on various system activities, such as disk performance, latency, and more using the bcc-tools.  This data can help identify issues with application performance."
    },
    {
      "external_link": "https://lab.redhat.com/user-basics",
      "title": "Manage user accounts and groups [Admin 101]",
      "description": "Create users and groups, adjust memberships, and recommended practices for disabling accounts."
    },
    {
      "external_link": "https://lab.redhat.com/imagebuilder",
      "title": "Using Web Console to build virtual machine images [Image Builder]",
      "description": "Learn how to manage virtual machines produced for different providers through a single, Web Console included application."
    },
    {
      "external_link": "https://lab.redhat.com/imagebuilder-cli",
      "title": "Design and build virtual machine images using commandline tools [Image Builder]",
      "description": "Move into the Hybrid Cloud by building consistent virtual machines produced for virtualization or cloud providers with the composer-cli commandline tool."
    },
    {
      "external_link": "https://lab.redhat.com/installing-software-yum",
      "title": "Installing Software using Package Managers [Admin 101]",
      "description": "Learn how to use YUM and RPM to streamline installations and verify local software."
    },
    {
      "external_link": "https://lab.redhat.com/insights-workshop",
      "title": "Resolving issues with Red Hat Insights Advisor",
      "description": "Register systems and proactively resolve potential issues with Insights Advisor."
    },
    {
      "external_link": "https://lab.redhat.com/buildah",
      "title": "Creating images with Container Tools [buildah]",
      "description": "Try different methods to build an application container, modify an existing container image and build one from scratch using the Container Tool buildah."
    },
    {
      "external_link": "https://lab.redhat.com/service-admin",
      "title": "Service Administration Basics [Admin 101]",
      "description": "Learn the distinction between processes, services, and daemons, as well as how to interact with them on your system."
    },
    {
      "external_link": "https://lab.redhat.com/unixisms",
      "title": "Unusual Unixisms [Admin 101]",
      "description": "Learn how to avoid common pitfalls for new Linux users."
    },
    {
      "external_link": "https://lab.redhat.com/kpatch-apply",
      "title": "Reducing unplanned maintenance with Kernel Live Patching",
      "description": "Resolve Critical Vulnerabilities and Exposures (CVEs) by applying Kernel Live Patches to your systems without needing to take a system downtime for maintenance."
    },
    {
      "external_link": "https://lab.redhat.com/webconsole-software",
      "title": "Managing system updates using the web console",
      "description": "Explore how someone with limited Linux experience can apply system updates to Red Hat Enterprise Linux systems through this user friendly web interface."
    },
    {
      "external_link": "https://lab.redhat.com/networking-basics",
      "title": "Configuring Network Interfaces [Admin 101]",
      "description": "Learn how to apply network settings to interfaces and manage connections using Network Manager and the nmcli command."
    },
    {
      "external_link": "https://lab.redhat.com/selinux-containers",
      "title": "Securing containers with SELinux [Udica]",
      "description": "Protect your container isolation by applying SELinux policies to determine which host resources are available to a running container."
    },
    {
      "external_link": "https://lab.redhat.com/crypto-policy",
      "title": "Configuring the system-wide cryptographic policy",
      "description": "Enforce more complex ciphers, protocol versions, and usable ciphers across all services running on your machines."
    },
    {
      "external_link": "https://lab.redhat.com/customize-crypto-policy",
      "title": "Customize the system-wide cryptographic policy",
      "description": "Create your own customized system-wide cryptographic policy to suit your environment while still applying the policy to all applications that utilize the cryptographic libraries with Red Hat Enterprise Linux."
    },
    {
      "external_link": "https://lab.redhat.com/containerize-app",
      "title": "Build an application into a container image using RHEL Container Tools",
      "description": "Containerize a 3rd party application into a Red Hat Universal Base Image (UBI) based container."
    },
    {
      "external_link": "https://lab.redhat.com/vdo-configure2",
      "title": "Reducing Operational and Storage Costs with Virtual Data Optimizer (VDO)",
      "description": "Explore how Virtual Data Optimizer (VDO) can reduce the amount of disk space files use, allowing you to save on storage costs."
    },
    {
      "external_link": "https://lab.redhat.com/stratis-configure",
      "title": "Stratis, a new Red Hat Enterprise Linux storage technology",
      "description": "Get started with Stratis, a pool-based storage technology included with Red Hat Enterprise Linux."
    },
    {
      "external_link": "https://lab.redhat.com/sandbox",
      "title": "Red Hat Enterprise Linux Open Lab",
      "description": "This lab environment has no pre-planned lab content.  It provides a place to try out Red Hat Enterprise Linux 8."
    },
    {
      "external_link": "https://lab.redhat.com/pcp-flamegraphs",
      "title": "Visualizing performance using flame graphs in Red Hat Enterprise Linux",
      "description": "Generate flame graphs on RHEL to visualize system and application performance metrics"
    },
    {
      "external_link": "https://lab.redhat.com/pcp-intro",
      "title": "Performance Co-Pilot (PCP) on Red Hat Enterprise Linux",
      "description": "Use PCP on RHEL to capture and analyze system and application metrics"
    },
    {
      "external_link": "https://lab.redhat.com/webconsole-perf",
      "title": "Using Web Console to Monitor Performance",
      "description": "Monitor system performance using the RHEL web console"
    },
    {
      "external_link": "https://lab.redhat.com/sql-server-ansible",
      "title": "Installing and configuring Microsoft SQL Server on Red Hat Enterprise Linux using RHEL System Roles",
      "description": "Use Ansible powered RHEL System Roles to install and configure Microsoft SQL Server on Red Hat Enterprise Linux"
    },
    {
      "external_link": "https://lab.redhat.com/sql-server-crypto-policy",
      "title": "Red Hat Enterprise Linux Crypto Policy and Transparent Data Encryption (TDE) With SQL Server",
      "description": "Use Microsoft SQL Server with RHEL system-wide crypto policies and configure TDE"
    },
    {
      "external_link": "https://lab.redhat.com/openscap",
      "title": "Using OpenSCAP for security compliance and vulnerability scanning",
      "description": "Learn about tools based on the Security Content Automation Protocol (SCAP) standard for compliance and vulnerability scanning"
    },
    {
      "external_link": "https://lab.redhat.com/sql-server-session-recording",
      "title": "Terminal Session Recording and SQL Server Auditing",
      "description": "Users will be able to enable review recorded sessions in Red Hat Enterprise Linux, and track activity inside SQL Server using it's auditing feature."
    },
    {
      "external_link": "https://lab.redhat.com/sql-server-ubi",
      "title": "Microsoft SQL Server on Red Hat Enterprise Linux using Red Hat Universal Base Image (UBI)",
      "description": "Users will be able to run Microsoft SQL Server on RHEL using UBI and Red Hat container tools"
    },
    {
      "external_link": "https://lab.redhat.com/sql-server-insights",
      "title": "Using Red Hat Insights With SQL Server",
      "description": "Users will be able to register Red Hat Enterprise Linux (RHEL) systems with Red Hat Insights as well as use cloud.redhat.com to apply Insights for Microsoft SQL Server running on RHEL"
    },
    {
      "external_link": "https://lab.redhat.com/ansible-idm",
      "title": "Deploying Red Hat Identity Management (IdM)",
      "description": "Using command-line ansible to deploy Red Hat Identity Management (IdM) and running IdM health-check"
    }
  ]
}
